const TelegramBot = require('node-telegram-bot-api');
const API_KEY_BOT = require("./src/botKey")
const langChoose = require("./langChoose")
const commands = require("./src/commands")
const getChatMember = require("./getMember")
const getChatMemberKz = require("./getMemberKz")

const bot = new TelegramBot(API_KEY_BOT, {polling: true});

const adminId = "7400510345"
let user = ""
let userChat = ""

bot.on('text', async msg => {

    user = msg.chat.id
    userChat = msg.chat

    try {

        if(msg.text.startsWith('/start')) {
            await bot.sendMessage(user, "Тілді таңдаңыз / Выберите язык", {
                reply_markup: {
                    inline_keyboard: [
                        [{text: "қазақша", callback_data: "kz"}, {text: "русский", callback_data: "ru"}],
                    ]
                }
            })
        }

    }
    catch(error) {
        console.log(error);
    }

})

bot.on("callback_query", async (ctx) => {
    try{
        switch(ctx.data){

            case "ru":
                langChoose(user, bot, "ru")
                break

            case "kz":
                langChoose(user, bot, "kz")
                break

            case "MFO":
                await bot.sendMessage(user, "Предоставление графика в МФО \n \n Мы работаем с микрофинансовыми организациями (МФО) и банками, помогая вам урегулировать задолженности. Мы предоставляем графики платежей, которые могут быть составлены от 3 до 12 месяцев, в зависимости от компании и суммы задолженности. Рассмотрение заявок по закону занимает до 15 рабочих дней, а первые графики могут быть выданы в течение 8–9 дней. \n \n Мы работаем 🌍 онлайн и удаленно по всему Казахстану, что позволяет вам получить помощь независимо от вашего местоположения. Оплата наших услуг осуществляется официально через Каспи 💳. Мы также подписываем договор 📜, обеспечивая юридическую защиту для обеих сторон. \n💰 Стоимость услуги:  \n Сумма одного займа:  9 000 KZT. \n \nперейти к менеджеру:  @komek_halykkz")
                break
    
            case "arrest":
                 await bot.sendMessage(user, "Отмена исполнительной надписи и снятие ареста \n \n 🚀 Процедура снятия ареста и отмены исполнительной надписи занимает всего 3–5 рабочих дней. \n \n  Что это дает вам? \n    1️⃣ 	Отсутствие процентов частного судебного исполнителя: вам не нужно будет оплачивать 25% от суммы долга, которые обычно требуют частные судебные исполнители. \n   2️⃣	 Разблокировка счетов: ваши банковские счета будут разблокированы, и вы сможете вновь пользоваться банковскими услугами без ограничений. \n 	3️⃣ Отсутствие арестов на имущество: арест будет снят, и вы сможете распоряжаться своим имуществом без ограничений. \n  \n💰 Стоимость услуги: \n •	5000 KZT за один арест. \n  \nперейти к менеджеру:  @komek_halykkz")
                break
    
            case "bankruptcy":
                await bot.sendMessage(user, "Внесудебное банкротство физического лица \n \n 💡 Если ваш долг не превышает 1600 МРП (6 291 200 KZT на 2025 год), вы не имеете имущества, а задолженность просрочена более 12 месяцев, вы можете подать заявление на внесудебное банкротство. \n \nТакже вы можете воспользоваться процедурой, если:     \n 📌 Вы получаете адресную социальную помощь (АСП), и просрочка составляет более 6 месяцев. \n 📌 Ваш долг просрочен более 5 лет. \n \n  🎯 Что дает банкротство? \n ✔️ Списание долгов перед банками и МФО. \n ✔️ Снятие ограничений со всех счетов. \n ❌ После банкротства вы не сможете брать кредиты и ипотеку в течение 5 лет. \n  ⛔ Повторно применить банкротство можно будет только через 7 лет. \n 🔍 Финансовая деятельность будет находиться под наблюдением в течение 3 лет. \n \n 💳 Стоимость услуги — от 30 000 до 70 000 KZT. \nперейти к менеджеру:  @komek_halykkz ")
                break
    
            case "debt":
                await bot.sendMessage(user, "Работа с задолженностями банков второго уровня \n \n  💼 Для урегулирования задолженностей в банках второго уровня требуется индивидуальный подход. Такие банки часто применяют сложные процедуры для реструктуризации долгов, предоставления отсрочек или изменения условий выплат. \n \n 🔹 Мы поможем вам: \n ✔️ Разработать план реструктуризации задолженности. \n ✔️ Провести переговоры с банком для получения более выгодных условий. \n ✔️ Подготовить полный пакет документов для подачи заявлений и запросов. \n \nперейти к менеджеру:  @komek_halykkz ")
                break
                
            case "getInstructions":
                await bot.sendMessage(user, "Komek_halykkz компаниясына қош келдіңіз, ссылкаға басып. телефон нөмеріңіз арқылы тіркеліңіз! \n\nТөмендегі инструкция бойынша жасаңыз! \n\n Добро пожаловать в Komek_halykkz, пройдите по ссылке, сделайте регистрацию по номер телефона! \n\n Дальше следуйте инструкции!")
                await bot.sendMessage(user, "https://cabinet.ffin.life/editProfile")
                await bot.sendDocument(user, "instructions.pdf")
                break

            case "MFOKZ":
                await bot.sendMessage(user, "МФО ұйымынан график алу \n \n Біз сіздің қарыздарыңызды реттеуге көмектесу үшін микроқаржы ұйымдарымен (МҚҰ) және банктермен жұмыс істейміз. Қарыз сомасына және компанияға байланысты төлем кестелері 3 айдан 12 айға дейін болуы мүмкін. Заң бойынша өтініштерді қарау 15 жұмыс күніне дейін созылады, ал алғашқы кестелер 8–9 күн ішінде дайын болуы мүмкін. \n \nБіз Қазақстан бойынша 🌍 онлайн және қашықтан жұмыс істейміз, бұл сіздің орналасқан жеріңізге қарамастан көмек алуға мүмкіндік береді. Біздің қызметтерді төлеу Kaspi 💳 арқылы ресми түрде жүзеге асырылады. Сондай-ақ, екі тараптың құқықтарын қорғау үшін 📜 келісімге қол қоямыз. \n \n 💰 Қызмет құны: \n \nБір несие сомасы: 9 000 теңге. \n \n Менеджермен байланысып, көмек алу үшін осында басыңыз:  @komek_halykkz")
                await bot.sendMessage(adminId, `клиент: @${userChat.username} \nимя: ${userChat.first_name} \n \nтема: МФО ұйымынан график алу`,)
                break
            
            case "arrestKZ":
                await bot.sendMessage(user, "Атқарушылық жазбаны жою және бұғатты шешу \n \n 🚀 Атқарушылық жазбаны жою және бұғатты шешу бар болғаны 3–5 жұмыс күнін алады. \n \nБұл сізге не береді? \n1️⃣ Жеке сот орындаушысының пайыздарынан босату:Сізге қарыз сомасының 25%-ын төлеудің қажеті жоқ, бұл жеке сот орындаушылары жиі талап ететін төлем. \n \n2️⃣ Шоттарды бұғаттан босату: \nБанк шоттарыңыз бұғаттан босатылып 💳, сіз банк қызметтерін шектеусіз пайдалана аласыз. \n \n3️⃣ Мүлікке салынған бұғатты шешу: \n Мүлікке салынған бұғат алынып 🏠, сіз өз мүлкіңізді еркін пайдалана аласыз. \n \n💰 Қызмет құны: \nБір бұғат үшін 5000 KZT. \n \n Менеджермен байланысып, көмек алу үшін осында басыңыз:  @komek_halykkz")
                await bot.sendMessage(adminId, `клиент: @${userChat.username} \nимя: ${userChat.first_name} \n \nтема: Атқарушылық жазбаны жою және бұғатты шешу`,)
                break
            
            case "bankruptcyKZ":
                await bot.sendMessage(user, "Соттан тыс жеке тұлғаның банкроттығы \n \n 💡 Егер сіздің қарызыңыз 1600 АЕК-тен аспаса (2025 жылға 6 291 200 KZT), сіздің атыңызда мүлік тіркелмесе, ал қарыздың мерзімі 12 айдан асса, сіз соттан тыс банкроттыққа өтініш бере аласыз. \n \nСондай-ақ, келесі жағдайларда да бұл процедураны қолдана аласыз: \n📌 Егер сіз атаулы әлеуметтік көмек (АӘК) алып жүрсеңіз және қарыз мерзімі 6 айдан асса. \n📌 Егер қарыз мерзімі 5 жылдан асқан болса. \n \n🎯 Банкроттық не береді? \n✔️ Банктер мен микроқаржы ұйымдары алдындағы қарыздар есептен шығарылады. \n ✔️ Барлық шоттардан шектеулер алынады. \n❌ Банкроттықтан кейін 5 жыл бойы несие және ипотека ала алмайсыз. \n⛔ Қайтадан банкроттыққа тек 7 жылдан кейін өтініш бере аласыз. \n🔍 Қаржылық қызметіңіз 3 жыл бойы бақылауда болады. \n \n💳 Қызмет құны — 30 000–70 000 KZT. \n \n Менеджермен байланысып, көмек алу үшін осында басыңыз:  @komek_halykkz")
                await bot.sendMessage(adminId, `клиент: @${userChat.username} \nимя: ${userChat.first_name}, \n \nтема: Соттан тыс жеке тұлғаның банкроттығы`,)
                break
            
            case "debtKZ":
                await bot.sendMessage(user, "Екінші деңгейлі банктердегі қарыздармен жұмыс \n \n💼 Екінші деңгейлі банктердегі қарыздарды реттеу жеке тәсілді талап етеді. Мұндай банктер қарызды қайта құрылымдау, төлемдерді кейінге қалдыру немесе төлем шарттарын өзгерту үшін күрделі рәсімдерді жиі қолданады. \n \n🔹 Біз сізге көмектесеміз: \n✔️ Қарызды қайта құрылымдау жоспарын әзірлеуге. \n✔️ Банктермен тиімді шарттарға қол жеткізу үшін келіссөздер жүргізуге. \n✔️ Өтініштер мен сұрауларға арналған құжаттардың толық пакетін дайындауға. \n \n Менеджермен байланысып, көмек алу үшін осында басыңыз:  @komek_halykkz")
                await bot.sendMessage(adminId, `клиент: @${userChat.username} \nимя: ${userChat.first_name}, \n \nтема: Екінші деңгейлі банктердегі қарыздармен жұмыс`,)
                break

            case "checkSub":
                await getChatMember(user, bot)
                break
            
            case "checkSubKz":
                await getChatMemberKz(user, bot)
                break
        }

    }
    catch(error) {
        console.log(error);
    }
})

bot.setMyCommands(commands)